src/Documents/PurchaseOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>PurchaseOrder</Name>
			<BasedOn>
				<xr:Item>Document.PurchaseQuote</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Locations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentPurchaseQuote</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PurchaseQuote</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Product</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LineTotal</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Received</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UM</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UnitsOfMeasure</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QuantityUM</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Invoiced</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Descr</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATCode</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATCodes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VAT</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>USTaxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor1099</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirstName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MiddleName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Country</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.States</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpenseAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Bank</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Banks</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Website</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Notes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/PurchaseOrder/Ext/ManagerModule.bsl
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,
           ОбъектыПечати, ПараметрыВывода) Экспорт

     // Устанавливаем признак доступности печати покомплектно.
     ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

     // Проверяем, нужно ли для макета СчетЗаказа формировать табличный документ.
     Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "PurchaseOrder") Тогда

         // Формируем табличный документ и добавляем его в коллекцию печатных форм.
         УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
             "PurchaseOrder", "Purchase order", ПечатьSalesInvoice(МассивОбъектов, ОбъектыПечати, "UMOff"));

	КонецЕсли;
		 
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "PurchaseOrderUM") Тогда

         // Формируем табличный документ и добавляем его в коллекцию печатных форм.
         УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
             "PurchaseOrderUM", "Purchase order", ПечатьSalesInvoice(МассивОбъектов, ОбъектыПечати, "UMOn"));

	КонецЕсли;

		 
КонецПроцедуры
	 
Функция ПечатьSalesInvoice(МассивОбъектов, ОбъектыПечати, UMMode)
   // Создаем табличный документ и устанавливаем имя параметров печати.
   ТабличныйДокумент = Новый ТабличныйДокумент;
   ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_PurchaseOrder";

   // Получаем запросом необходимые данные.
   Запрос = Новый Запрос();
   Запрос.Текст =
   "SELECT
   |	PurchaseOrder.Ref,
   |	PurchaseOrder.Company,
   |	PurchaseOrder.Date,
   |	PurchaseOrder.DocumentTotal,
   |	PurchaseOrder.Number,
   |	PurchaseOrder.Currency,
   |	PurchaseOrder.VATTotal,
   |	PurchaseOrder.LineItems.(
   |		Product,
   |		Descr,
   |		Quantity,
   |		UM,
   |		QuantityUM,
   |		Price,
   |		LineTotal
   |	)
   |FROM
   |	Document.PurchaseOrder AS PurchaseOrder
   |WHERE
   |	PurchaseOrder.Ref IN(&МассивОбъектов)";
   Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
   Selection = Запрос.Выполнить().Выбрать();

   
   ПервыйДокумент = Истина;

    //360
	OurCompany = Catalogs.Companies.OurCompany;
	//360
   
   Пока Selection.Следующий() Цикл
     Если Не ПервыйДокумент Тогда
       // Все документы нужно выводить на разных страницах.
       ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
     КонецЕсли;
     ПервыйДокумент = Ложь;
     // Запомним номер строки, с которой начали выводить текущий документ.
     НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	 
	If UMMode = "UMOff" Then
	 	Макет = УправлениеПечатью.ПолучитьМакет("Document.PurchaseOrder.ПФ_MXL_PurchaseOrder");
	Else
		Макет = УправлениеПечатью.ПолучитьМакет("Document.PurchaseOrder.ПФ_MXL_PurchaseOrderUM");
	EndIf;
	 
	 ОбластьМакета = Макет.ПолучитьОбласть("Header");
	 
	OurCompanyInfo = PrintTemplates.ContactInfo(OurCompany);
	CounterpartyInfo = PrintTemplates.ContactInfo(Selection.Company);
	
	ОбластьМакета.Параметры.OurCompanyName = OurCompanyInfo.Name;
	ОбластьМакета.Параметры.OurCompanyAddress = OurCompanyInfo.Address;
	ОбластьМакета.Параметры.OurCompanyZIP = OurCompanyInfo.ZIP;
	ОбластьМакета.Параметры.OurCompanyPhone = OurCompanyInfo.Phone;
	ОбластьМакета.Параметры.OurCompanyEmail = OurCompanyInfo.Email;
	ОбластьМакета.Параметры.OurCompanyCountry = OurCompanyInfo.Country;
	
	ОбластьМакета.Параметры.CounterpartyName = CounterpartyInfo.Name;
	ОбластьМакета.Параметры.CounterpartyAddress = CounterpartyInfo.Address;
	ОбластьМакета.Параметры.CounterpartyZIP = CounterpartyInfo.ZIP;
	ОбластьМакета.Параметры.CounterpartyCountry = CounterpartyInfo.Country;
	 	 
	 ОбластьМакета.Параметры.Date = Selection.Date;
	 ОбластьМакета.Параметры.Number = Selection.Number;
	 
	 ТабличныйДокумент.Вывести(ОбластьМакета);

	 ОбластьМакета = Макет.ПолучитьОбласть("LineItemsHeader");
	 ТабличныйДокумент.Вывести(ОбластьМакета);
	 
	 SelectionLineItems = Selection.LineItems.Choose();
	 ОбластьМакета = Макет.ПолучитьОбласть("LineItems");
	 LineTotalSum = 0;
	 While SelectionLineItems.Next() Do
		 
		 ОбластьМакета.Parameters.Fill(SelectionLineItems);
		 LineTotal = SelectionLineItems.LineTotal;
		 LineTotalSum = LineTotalSum + LineTotal;
		 ТабличныйДокумент.Вывести(ОбластьМакета, SelectionLineItems.Level());
		 
	 EndDo;
	 
	Try 
		ОбластьМакета = Макет.ПолучитьОбласть("ExtraLines");
		ТабличныйДокумент.Вывести(ОбластьМакета);
	Except
	EndTry; 
	 
	If Selection.VATTotal <> 0 Then;
		 ОбластьМакета = Макет.ПолучитьОбласть("Subtotal");
		 ОбластьМакета.Параметры.Subtotal = LineTotalSum - Selection.VATTotal;
		 ТабличныйДокумент.Вывести(ОбластьМакета);
		 
		 ОбластьМакета = Макет.ПолучитьОбласть("VAT");
		 ОбластьМакета.Параметры.VATTotal = Selection.VATTotal;
		 ТабличныйДокумент.Вывести(ОбластьМакета);
	EndIf; 
		 
	 ОбластьМакета = Макет.ПолучитьОбласть("Total");
	 ОбластьМакета.Параметры.DocumentTotal = LineTotalSum;
	 ТабличныйДокумент.Вывести(ОбластьМакета);

	 ОбластьМакета = Макет.ПолучитьОбласть("Currency");
	 ОбластьМакета.Параметры.Currency = Selection.Currency;
	 ТабличныйДокумент.Вывести(ОбластьМакета);
	 
     // В табличном документе необходимо задать имя области, в которую был 
     // выведен объект. Нужно для возможности печати покомплектно 
     УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Selection.Ref);

   КонецЦикла;
   
   Возврат ТабличныйДокумент;
   
КонецФункции
